/****************************************Copyright (c)****************************************************
**--------------File Info---------------------------------------------------------------------------------
** File name:              led_test.c
** Latest modified Date:    2019-3-14	
** Latest Version:          
** Descriptions:            测试led驱动
**--------------------------------------------------------------------------------------------------------
** Created by:             张桂荧
** Created date:            2019-3-14	
** Version:                 
** Descriptions:            显示一些字符
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/

#include"led_display.h"

int time_count;
int init_val;
void Timer0_ISR(void) interrupt 1 using 1 
{
	//P1=~P1;
	led_display_scan();
	TH0=init_val/256;
	TL0=init_val%256;
	
	//if(time_count) time_count--;
}

int main(){
	char *str="EBY.583";
	int time_count=10;
	led_display_puts(str);
	TMOD|=0x01;
	EA = 1;
	init_val = 65536-200;
	TH0=init_val/256;
	TL0=init_val%256;	
	ET0=1;
	TR0=1;
	//LED_SEG_DATA(led_show_buf[0]);
	while(1){
		//timer_init_with_time(100);
		//led_display_scan();
		//delay100us(10);
	}
	return 0;

}

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/

